let tips = [
    {
        title : "Белогорье",
        desc  : "Один из многих городов, которые были основаны во времена Старого Королевства, и является одним из немногих, кто пережил его разрушение. На данный момент, является единственным городом в Северных пустошах."
    },
    {
        title : "Крючий Берег. Северное аббатсво",
        desc  : "Заснеженный портовый город, расположенный на небольшом острове. На этом острове есть маяк, который раньше указывал путь кораблям идущим в Северные пустоши. Материалы из которых сделаны здания уже потускнели, так как взять новые для замены не откуда."
    },
    {
        title : "Нотхоул Глэйд",
        desc  : "Древнее поселение(город), основанное лесорубами. В центре Нотхоул Глэйд расположена статуя Скарлет Роуб, которая в своё время прославилась как крайне умелая охотница на оборотней."
    },
    {
        title : "Причуда Архонта",
        desc  : "Место финальной битвы героя с Джеком-из-Тени(в облике дракона).Здесь игрок должен выбрать, навсегда уничтожить древнее зло в маске или поддаться её влиянию."
    },
    {
        title : "Оуквэйл. Дубовый дол",
        desc  : "Локация, которая встречает нас в игре. Во время детства Героя,  Дубовый Дол был маленькой развивающейся деревней, когда на него напали разбойники. Через какое-то время, после нападения, деревня была восстановлена и расширена. На кладбище города похоронена Скарлет Роуб(мать главного героя, также состояла в Гильдии Героев и первая женщина, получившая титул Чемпиона Арены)"
    },
    {
        title : "Бауэрстоун.Глушвилль",
        desc  : "Город делится на две части. Южная, которая доступна с самого начал путешествия и Северная, которая открывается после прохождения Арены главным героем"
    },
    {
        title : "Гильдия Героев",
        desc  : "Отсюда начинается путь взросления героя. Главный опорный пункт, где расположена карта мира и механизм распределения опыта. В Гильдии скрыто два самых сильных меча в мире. Первый - это Меч Веков спрятанный Жнецом в Палате Судьбы, а Второй - это Слеза Аво который хранят души великих героев прошлого."
    }
];
let weapons = [
    {
        title : "Слеза Аво",
        desc : "Этот меч, который великий маг Гильдии, Сольциус, использовал для заклятия, успокоившего огромный магический портал, наделен необычайной силой. Долгое время это оружие существовало лишь в сказках. Мощь его сравнима с могуществом самого Меча Веков."
    },
    {   
        title : "Катана Хи'рю",
        desc : "Прочность металла ограничена. Но монахи далеких Холмов своими сверхъестественными силами превратили «Хир'ю» в нечто особое. Тайна ее изготовления умерла вместе с ними. Хир'ю переводится с японского, как летящий дракон."
    },
    {
        title : "Булава Кукольника",
        desc : "Великого Кукольника отличали ловкие пальцы и внимание к мелким деталям. Но лишь однажды он применил своё мастерство для изготовления оружия. Результат был столь же блестящ, что и раньше."
    },
    {
        title : "Предвестник",
        desc : "Этот длинный меч сковали близнецы Эльда и Эсса. Завершив работу, они отрубили друг другу руки, чтобы мир никогда не увидел другого подобного оружия."
    },
    {
        title : "Роногг",
        desc : "Жизнь топора обычно коротка и сурова. Но «Роногг» пережил столетия, полные  битв, и по-прежнему остер, как и в тот день, когда его выковали егери Стародавнего Королевства."
    },
    {
        title : "Большой меч Солус",
        desc : "Оружие, некогда принадлежавшее легендарному Солусу мистическому Воину-Дракону. Это оружие держало в страхе мастеров мечей и тому подобные воинственные стороны Альбиона."
    },
    {
        title : "Мурренский молот",
        desc : "Во время хаоса, последовавшего за падением Стародавнего Королевства, Мурренские могилы были разграблены, но ни этого молота ни Мурренской секиры грабители так и не нашли. Говорят, их выковали по приказу самих Богов."
    },
    {
        title : "Мурренская секира",
        desc : "Мало что известно о подобном богам воине, из мертвых рук коего выпала эта секира, однако её можно встретить в руках статуи матери главного героя в Нотхоул Глэйде."
    },
    {
        title : "Лук Скорма",
        desc : "Этот лук - легендарное оружие Оверберга - хранит мрачные и страшные тайны, наделяющие полёт его стрел необычайной мощью. Чтобы получить этот лук, нужно приносить жертвы Капищу Скорма. Самый мощный лук в игре."
    },
    {
        title : "Арбалет Аркена",
        desc : "Аркен был воином армии, попавшей в засаду и погибшей во время Булаганской бойни. Его приняли за мёртвого и оставили на поле боя. Он собрал этот арбалет из жалких обломков и с его помощью перестрелял всех нападавших до единого."

    }
];
let equipment = [
    {
        title : "Сельский наряд" ,
        desc : "Полный комплект одежды селянина. Не обеспечивает должной защиты в битве."
    },
    {
        title : "Кольчуга",
        desc : "Вызывает подозрения, но и обеспечивает надёжную защиту в сражении."
    },
    {
        title : "Наряд Ассасина",
        desc : "Комплект одежды для наёмного убийцы, помогает оставаться незамеченным(нет)."
    },
    {
        title : "Кожаные доспехи",
        desc : "Защиту обеспечивает не слишком серьёзную, зато подходит для развязных вечеринок."
    },
    {
        title : "Латы",
        desc : "Полный комплект прочных латных доспехов."
    },
    {
        title : "Наряд мастера воли",
        desc : "Полный костюм Мастера Воли. Обеспечивает защиту против магии."
    },
    {
        title : "Боевая броня Архонта",
        desc : "Доспех, который носил легендарный король Архонт, возглавивший множество боёв с врагами Альбиона. Броня сделана из останков последнего платинового тролля. Этот материал до сих пор считается самым прочным"
    },
    {
        title : "Светлое платье",
        desc : "Этому платью позавидует самая красивая девушка Альбиона. Правда, от побоев оно не защитит. Перчатки изготовлены из ткани, достойной любой, взыскательной леди"
    }
];
let raznoe =[
    {
        title: "Разные предметы",
        desc: "Здесь находится всё, от эскизов татуировок, еды, удочек до драгоценных камней, эликсиров и модификаторов оружия"
    }
]
$(".map-point").on("mousemove", function(e){
    let id = parseInt($(this).attr("id").substr(5, 1));
    $("#map-info").css({
        display : "block",
        top : `${e.pageY + 10}px`,
        left : `${e.pageX + 10}px`
    });
    $("#map-info>h4").text(tips[id-1].title);
    $("#map-info>p").text(tips[id - 1].desc);
});
$(".map-point").on("mouseleave", function(){
    $("#map-info").css("display", "none");
    $("#map-info>p").text("");
    $("#map-info>h4").text("");
});
$(".seventh-prop").on("mousemove", function(){
    $(this).children("p").fadeIn(400).css("display", "flex");
});
$(".seventh-prop").on("mouseleave", function(){
    $(this).children("p").fadeOut(400);
});