let tips = [
    {
        title : "Белогорье",
        desc  : "Один из многих городов, которые были основаны во времена Старого Королевства, и является одним из немногих, кто пережил его разрушение. На данный момент, является единственным городом в Северных пустошах."
    },
    {
        title : "Крючий Берег. Северное аббатсво",
        desc  : "Заснеженный портовый город, расположенный на небольшом острове. На этом острове есть маяк, который раньше указывал путь кораблям идущим в Северные пустоши. Материалы из которых сделаны здания уже потускнели, так как взять новые для замены не откуда."
    },
    {
        title : "Нотхоул Глэйд",
        desc  : "Древнее поселение(город), основанное лесорубами. В центре Нотхоул Глэйд расположена статуя Скарлет Роуб, которая в своё время прославилась как крайне умелая охотница на оборотней."
    },
    {
        title : "Причуда Архонта",
        desc  : "Место финальной битвы героя с Джеком-из-Тени(в облике дракона).Здесь игрок должен выбрать, навсегда уничтожить древнее зло в маске или поддаться её влиянию."
    },
    {
        title : "Оуквэйл. Дубовый дол",
        desc  : "Локация, которая встречает нас в игре. Во время детства Героя,  Дубовый Дол был маленькой развивающейся деревней, когда на него напали разбойники. Через какое-то время, после нападения, деревня была восстановлена и расширена. На кладбище города похоронена Скарлет Роуб(мать главного героя, также состояла в Гильдии Героев и первая женщина, получившая титул Чемпиона Арены)"
    },
    {
        title : "Бауэрстоун.Глушвилль",
        desc  : "Город делится на две части. Южная, которая доступна с самого начал путешествия и Северная, которая открывается после прохождения Арены главным героем"
    },
    {
        title : "Гильдия Героев",
        desc  : "Отсюда начинается путь взросления героя. Главный опорный пункт, где расположена карта мира и механизм распределения опыта. В Гильдии скрыто два самых сильных меча в мире. Первый - это Меч Веков спрятанный Жнецом в Палате Судьбы, а Второй - это Слеза Аво который хранят души великих героев прошлого."
    }
];
$(".map-point").on("mousemove", function(e){
    let id = parseInt($(this).attr("id").substr(5, 1));
    $("#map-info").css({
        display : "block",
        top : `${e.pageY + 10}px`,
        left : `${e.pageX + 10}px`
    });
    $("#map-info>h4").text(tips[id-1].title);
    $("#map-info>p").text(tips[id - 1].desc);
});
$(".map-point").on("mouseleave", function(){
    $("#map-info").css("display", "none");
    $("#map-info>p").text("");
    $("#map-info>h4").text("");
});